Revit 2027 API
CurveLoopsProfile.Profile Property
Returns the curve loops of the profile.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurveArrArray Profile { get; set; }
Public Property Profile As CurveArrArray
	Get
	Set
public:
property CurveArrArray^ Profile {
	CurveArrArray^ get ();
	void set (CurveArrArray^ value);
}
member Profile : CurveArrArray with get, set
Property Value
CurveArrArray
Remarks
This property is used to retrieve the curve loops of profile.
See Also
Reference
CurveLoopsProfile Class
Autodesk.Revit.DB Namespace